---
kind: type
id: T:Autodesk.Revit.DB.LinkNode
source: html/9141cd14-5aa4-d81f-66ad-8ca3af394886.htm
---
# Autodesk.Revit.DB.LinkNode

An output node that represents a linked Revit document.

## Syntax (C#)
```csharp
public class LinkNode : GroupNode
```

## Remarks
See also: OnLinkBegin(LinkNode) .